sysprogs/BSPTools/generators/stm32/rules/classic/Samples/LEDBLINK_STM32F2X/LEDBlink.c
#include <stm32f2xx_gpio.h>
#include <stm32f2xx_rcc.h>

void Delay()
{
	int i;
	for (i = 0; i < $$com.sysprogs.examples.ledblink.DELAYCYCLES$$; i++)
		asm("nop");
}

int main()
{
  GPIO_InitTypeDef GPIO_InitStructure;
  
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_$$com.sysprogs.examples.ledblink.LEDPORT$$, ENABLE);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_$$com.sysprogs.examples.ledblink.LEDBIT$$;
  
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init($$com.sysprogs.examples.ledblink.LEDPORT$$, &GPIO_InitStructure);

  for (;;)
  {
	  GPIO_WriteBit($$com.sysprogs.examples.ledblink.LEDPORT$$, GPIO_Pin_$$com.sysprogs.examples.ledblink.LEDBIT$$, Bit_SET);
	  Delay();
	  GPIO_WriteBit($$com.sysprogs.examples.ledblink.LEDPORT$$, GPIO_Pin_$$com.sysprogs.examples.ledblink.LEDBIT$$, Bit_RESET);
	  Delay();
  }
}
